src/Catalogs/ВидыДоходовПоСтраховымВзносам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ВидыДоходовПоСтраховымВзносам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходитВБазуПФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВБазуФСС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВБазуФОМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВидыДоходовПоСтраховымВзносам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьВидыДоходовПоСтраховымВзносам() Экспорт

	СпрВидов = Справочники.ВидыДоходовПоСтраховымВзносам;

	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.НеЯвляетсяОбъектом, Ложь, Ложь, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.НеОблагаетсяЦеликом, Ложь, Ложь, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ПособияЗаСчетФСС, Ложь, Ложь, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ПособияЗаСчетФСС_НС, Ложь, Ложь, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ДенежноеДовольствиеВоеннослужащих, Ложь, Ложь, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ДенежноеСодержаниеПрокуроров, Ложь, Истина, Истина); // ПФР, ФОМС , ФСС

	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ОблагаетсяЦеликом, Истина, Истина, Истина);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ДоходыСтудентовЗаРаботуВСтудотрядеПоТрудовомуДоговору, Ложь,
		Истина, Истина); // ПФР, ФОМС, ФСС
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.Матпомощь, Истина, Истина, Истина);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.МатпомощьПриРожденииРебенка, Истина, Истина, Истина);

	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ДоговорыГПХ, Истина, Истина, Ложь); // ПФР, ФОМС, ФСС
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.ДоходыСтудентовЗаРаботуВСтудотрядеПоГражданскоПравовомуДоговору,
		Ложь, Истина, Ложь); // ПФР, ФОМС, ФСС
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеАудиовизуальныеПроизведения, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеГрафическиеПроизведения, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеДругиеМузыкальныеПроизведения, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеИсполнениеПроизведений, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеЛитературныеПроизведения, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеМузыкальноСценическиеПроизведение, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеНаучныеТруды, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеОткрытия, Истина, Истина, Ложь);
	ОписатьВидДоходаПоСтраховымВзносам(СпрВидов.АвторскиеСкульптуры, Истина, Истина, Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОписатьВидДоходаПоСтраховымВзносам(СпособОтражения, ВходитВБазуПФР, ВходитВБазуФОМС, ВходитВБазуФСС)

	Объект = СпособОтражения.ПолучитьОбъект();
	Объект.ВходитВБазуПФР = ВходитВБазуПФР;
	Объект.ВходитВБазуФОМС = ВходитВБазуФОМС;
	Объект.ВходитВБазуФСС = ВходитВБазуФСС;
	Объект.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
